#커서 공유
### 1. 커서란?
       1) 공유 커서(shared cursor) : 라이브러리 캐시에 공유돼있는 Shared SQL Area
       2) 세션 커서(session cursor) : Private SQL Area 에 저장된 커서
       3) 애플리케이션 커서 (application cursor) : 세션 커서를 가리키는 핸들
    
  #### 1) 공유커서
          Java, VB,Pro C, PL/SQL 등에서 SQL을 수행하면, 서버 프로세스는 해당 SQL 이 라이브러리 캐시에 공유돼 있는지 먼저 확인, 없으면 최적화 실행계획을 라이브러리 캐시에 공유
          - 라이브러리 캐시에 공유돼 있는 Shared SQL Area 를 '커서'라고 부른다.
  #### 2) 세션 커서
          라이브러리 캐시에 공유돼 있는 커서를 실행할 때 우선 PGA 영역에 메모리 할당 = Private SQL Area
          - Private SQL Area (두개로 나뉨)
            - Persistent Area
            - Runtime Area
          Shared SQL Area를 읽어서 커서 실행에 필요한 정보를 Private SQL Area에 담는다. 공유 커서를 가리키는 포인터 유지, 커서의 상태정보 관리, PGA에 저장된 커서 정보를 '커서'라고 한다.
  #### 3) 애플리케이션 커서
          PGA에 있는 커서를 핸들링하려면 클라이언트 애플리케이션에도 리소스 할당 = 커서

### 2. 커서 공유
       v$SQL에서 조회한 항목들
        - parse_calls :  라이브러리 캐시에서 SQL 커서를 찾으려는 요청 횟수
        - loads : 하드파싱을 거친 SQL 실행계획을 라이브러리 캐시에 적재한 횟수
        - executions : SQL 을 수행한 횟수
        - Invalidations : 커서가 무효화된 횟수. 커서가 참조하고 있는 오브젝트에 중요한 변화가 일어났음을 의미함
    - 다른 세션(다른 사용자)도 공유 커서를 재사용할 수 있다. 공유돼있던 커서가 무효화될 수 있는데 DDL 문이 수행되는 경우다.
      -> 오브젝트 통계를 재수집하여 이전에 수립된 실행계획이 더 이상 최적이 아닐 수 있으므로 해당 커서는 무효화되어야만 한다. **
    - 라이브러리 캐시에 있는 커서들이 여러 세션에 의해 공유되면서 반복 재사용.
      공유된 커서를 사용할 때는 최적화 및 Row-Source Generation 단계를 생략하고 곧바로 실행 단계로 넘어가므로 보다 효율적이고 빠르게 SQL을 수행한다. **
    - 커서가 공유되려면 식별 키값이 같아야 함. 라이브러리 캐시에서 캐시 식별 키 값 = SQL 문장 그 자체

### 3. Child 커서를 공유하지 못하는 경우
       Child cursor 가 많은 건 좋지 않음. 라이브러리 캐시 효율을 나쁘게 할 뿐.
       v$sqlarea 로 조회할 때 version=count 는 child cursor 의 수
    #### 하나의 SQL 문장(parernt cursor)이 여러 개 Child cursor를 갖게 되는 여러가지 이유
          1) SQL 에서 참조하는 오브젝트 명이 같지만 SQL을 실행한 사용자에 따라 다른 오브젝트를 가리킬 때
          2) 참조 오브젝트가 변경돼 커서가 무효화 되면 이후 그 커서를 처음 사용하려는 세션에 의해 다시 하드파싱돼야 하는데, 특정 세션이 아직 기존 커서를 사용 중(Pin)일 때
          3) 옵티마이저 모드를 비롯해 옵티마이저 관련 파리미터가 다를 때
          4) 입력된 바인드 값의 길이가 크게 다를 때
          5) NLS 파라미터를 다르게 설정했을 때
          6) SQL 트레이스를 활성화 했을 때
### 4. Parent 커서를 공유하지 못하는 경우
       ** 하드 파싱을 일으키고 서로 다른 공간을 차지해 Shared Pool 낭비의 원인. 개발 초기에 SQl 작성 표준을 정해 준수하도록 해야함. **
       1) 공백 문자 또는 줄 바꿈              
       2) 대소문자 구분
       3) 테이블 Owner 구분
       4) 주석 (Comment)  /*    */
       5) 옵티마이저 힌트 사용  /*+    */
       6) 조건절 비교 값
    - 라이브러리 캐시 효율과 직접 관련이 큰 것은 6)번과 같은 패턴이다. 즉, 조건절에 바인드 변수를 사용하지 않고 서로 다른 Literal 값으로 문자열 대체하는 경우 동시 트랜잭션이 몰리는 Peak 시간대에 시스템을 장애 상황으로 몰고 가는 주범이다.
